/*
-------------------------------
Neo Boost Gameplay
Mod made by jubbalub

Huge thanks to the following people
for lending me their code:
LexStorm
Trepe Serafin
Weezley
-------------------------------
*/

Code "Neo Boost main logic"
//
    #lib "Player"
	#lib "Sonic"
	#lib "HMM"
	#lib "INI"
	
	#include "BlackboardStatus" noemit
	
	using System.IO;
	using System.Collections.Generic;
	
	static bool configInit = false;
	static bool _isBoostPrevious = false;
	static bool enableSpindash;
	static string currentModDirectory;
	
	static List<Sonic.StateID> _boostStates = new()
    {
        Sonic.StateID.StateAirBoost,
        Sonic.StateID.StateBumpJump,
        Sonic.StateID.StateGrind,
        Sonic.StateID.StateGrindDamage,
        Sonic.StateID.StateGrindJump,
        Sonic.StateID.StateGrindRoot,
        Sonic.StateID.StateGrindStep,
        Sonic.StateID.StateJump,
        Sonic.StateID.StateLeftStepRun,
        Sonic.StateID.StateRightStepRun,
        Sonic.StateID.StateRun,
        Sonic.StateID.StateWallMove
    };
//
{
	if (!configInit)
	{
		// thanks Hyper for this code
        var mods = HMM.FindModsByName("Neo Boost Gameplay");
        // Duplicates present, aborting!
        if (mods.Count > 1)
        {
            // Skip config init on next loop, use default values.
            configInit = true;
            return;
        }
		currentModDirectory = mods[0].Path;

        var mods = HMM.FindModsByName("Neo Boost Gameplay");
        // Duplicates present, aborting!
        if (mods.Count > 1)
        {
            // Skip config init on next loop, use default values.
            configInit = true;
            return;
        }
		currentModDirectory = mods[0].Path;
        var configPath = Path.Combine(mods[0].Path, "mod.ini");
		var ini = INI.Read(configPath);
		hitstopDuration = INI.Parse<float>(ini["Main"]["hitstopDuration"], 0);
		nitroHitstopDuration = INI.Parse<float>(ini["Main"]["nitroHitstopDuration"], 0);
		
		configInit = true;
    }
	
	var GameHitStopParameterInfo = Reflection.GetDataInfo<GameHitStopParameter.Root>("hitstop");

	if (GameHitStopParameterInfo.pData == null)
		return;
	
	if (IS_WORLD_FLAG(IsCyberSpace))
	{
		RFL_SET_PARAM(GameHitStopParameterInfo, data[11].time, (hitstopDuration / 100));
		RFL_SET_PARAM(GameHitStopParameterInfo, data[44].time, (nitroHitstopDuration / 100));
		RFL_SET_PARAM(GameHitStopParameterInfo, data[45].time, (nitroHitstopDuration / 100));
	}
	else
	{
		RFL_SET_PARAM(GameHitStopParameterInfo, data[11].time, 0.2f);
		RFL_SET_PARAM(GameHitStopParameterInfo, data[44].time, 0.2f);
		RFL_SET_PARAM(GameHitStopParameterInfo, data[45].time, 0.15f);
	}
}

Library "GameHitStopParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public struct GameHitStopParameterData
    {
        [FieldOffset(0x00)] public UnmanagedString name;
        [FieldOffset(0x10)] public float scale;
        [FieldOffset(0x14)] public float time;
        [FieldOffset(0x18)] public float easeOutTime;
        [FieldOffset(0x1C)] public float delayTime;
        [FieldOffset(0x20)] public bool layerPlayer;
        [FieldOffset(0x21)] public bool layerEnemy;
        [FieldOffset(0x22)] public bool layerDamagedEnemy;
        [FieldOffset(0x23)] public bool layerCamera;
        [FieldOffset(0x24)] public bool layerOthers;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA00)]
    public struct Root
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* GameHitStopParameterData[64] */ _data[2560];

        public unsafe GameHitStopParameterData* data
        {
            get
            {
                fixed (byte* p_data = _data)
                    return (GameHitStopParameterData*)p_data;
            }
        }
    }

}
